{
  "openings": [
    {
      "title": "React Native Mobile App Developer",
      "role": "Mobile Development Internship",
      "description": "Join our mobile team to build and enhance our cross-platform fitness application using React Native. This is a great opportunity for aspiring developers to gain hands-on experience in a real-world product that impacts thousands of users.",
      "type": "Internship",
      "location": "Remote",
      "exReq": [
        "Proficiency in JavaScript, ES6+, and modern front-end principles.",
        "Familiarity with React and React Native.",
        "Understanding of mobile app development lifecycle.",
        "Basic knowledge of RESTful APIs and state management libraries (like Redux or MobX).",
        "A portfolio of personal projects or coursework demonstrating your skills.",
        "Currently pursuing or recently completed a degree in Computer Science or a related field.",
        "Eagerness to learn and a passion for building great mobile experiences."
      ]
    },
    {
      "title": "Digital Marketing Associate",
      "role": "Marketing Internship",
      "description": "Help us grow our user base and engage our community through creative and data-driven digital marketing campaigns. This role is perfect for students passionate about marketing, social media, and the fitness industry.",
      "type": "Internship",
      "location": "Remote",
      "exReq": [
        "Strong understanding of social media platforms (Instagram, TikTok, Twitter, Facebook).",
        "Excellent written and verbal communication skills.",
        "Familiarity with content creation, SEO principles, and email marketing is a plus.",
        "Ability to analyze data and generate insights.",
        "Creative mindset with a can-do attitude.",
        "Currently pursuing or recently completed a degree in Marketing, Communications, or a related field.",
        "A passion for fitness and building online communities."
      ]
    },
    {
      "title": "UI/UX Design Intern",
      "role": "Product Design",
      "description": "Create intuitive and beautiful user experiences for our web and mobile applications. This internship is a fantastic opportunity to work on a real product, from wireframing and prototyping to high-fidelity design, shaping the look and feel of our fitness platform.",
      "type": "Internship",
      "location": "Remote",
      "exReq": [
        "A portfolio showcasing your design process and UI/UX projects (coursework, personal projects, etc.).",
        "Familiarity with design tools like Figma, Sketch, or Adobe XD.",
        "Basic understanding of user-centered design principles, wireframing, and prototyping.",
        "Strong visual design skills with an eye for typography, color, and layout.",
        "Currently pursuing or recently completed a degree in Design, HCI, or a related field.",
        "Excellent communication skills and a willingness to learn and collaborate.",
        "A passion for creating user-friendly and engaging digital experiences."
      ]
    }
  ]
}
